import streamlit as st
import pandas as pd
import numpy as np

st.logo('https://upload.wikimedia.org/wikipedia/commons/2/2e/Syarah_Logo.png')

st.set_page_config(layout='centered')
st.markdown("<h1 style='text-align: right; '>هل أريد شراء سيارة مستعملة؟</h1>", unsafe_allow_html=True)


Welcome_text = '''
<div style="text-align: right"> 
عند بحثي عن سيارة للشراء تناسب امكانياتي وسؤالي للبعض عن السوق كان هناك العديد من الاحاديث عن ارتفاع أسعار السيارات ولجوء العديد للسيارات المستعملة حيث شدني الوضع للبحث ووجدت مقال يتحدث عن ارتفاع أسعار السيارات المستعملة وتوقع نمو بنسبة 5% لكل سنه بين 2023 الى 2028 وهذا يجلب العديد من التساؤلات، لماذا؟ وهل هناك نهاية لهذا السوق او التضخم فقط! هل يجب علي الشراء اليوم قبل الغد؟ كان هناك حاجه ملحه لدراسة الوضع  قبل الشراء والمخاطرة بأموالي؟ حيث وجدت موقع للسيارات المستعملة في المملكة العربية السعودية وقررت البحث فيها لمعرفة السوق ومعرفة توجهاته.

</div>
'''
st.html(Welcome_text)


st.image("Everyday LA.gif")




second = '''
<div style="text-align: right"> 

بدأت بالبحث عن الأسعار ووجدت أشهر موقع سعودي للسيارات المستعملة ولاحظت ان الأسعار ما بين ان تكون محدده مسبقا او ان تكون على السوم حيث يساوم البائع على السعر قد يزيد او ينقص بناء على خبرتي في المساومة وحتى ان الأسعار الموضحة في بعض الحالات تبدو فلكيه! فرغبتي في البحث عن أفضل سيارة جعلتني ابحث عن اغلى خمس سيارات موجوده في الموقع ووجدت شيء مشترك بينهم غالبيتهم من شركات بريطانية وواحده فقط المانية بمعدل من خمسمئة الف الى ثمانية الف! فلماذا توجهت الى سوق السيارات المستعملة في هذه الحالة! 

</div>
'''

st.html(second)


st.image('Q1_story.PNG')




third = '''
<div style="text-align: right"> 
قررت ان البحث عن أغلى السيارات ما هو الا مضيعة للوقت فيجب رؤية مختلف الأسعار لتحديد المناسب لي ورؤية مختلف أنواع السيارات وسنوات الصنع كان يجب علي تقسيم الأسعار الى ثلاث نطاقات ورؤية ما يناسبني.
</div>
'''

st.html(third)

st.image('Power_BI_Desktop_8_8_2024_1_22_51_PM.PNG')


forth = '''
<div style="text-align: right"> 

بعد رؤية النطاقات يبدو ان هناك تفاوت في الأسعار قد يناسبني يجب علي الان التحقق من سنة الصنع فلا اريد التورط بسيارة قديمة.
</div>
'''

st.html(forth)

st.image('Power_BI_Desktop_8_8_2024_1_22_37_PM.PNG')


fifth = '''
<div style="text-align: right"> 

بعد رؤية النطاقات يبدو ان هناك تفاوت في الأسعار قد يناسبني يجب علي الان التحقق من لاحظت ان هناك تذبذب في الأسعار الا ان هناك ارتفاع دائم في السيارات حديثة الصنع فبطبيعة الحال حداثتها عنصر مهم لي ولاي شخص يريد حقا شراء سيارة وليس هاوي للتجميع. فهل يجب علي الاستغناء عن الحداثة والراحة المصاحبة لها لتناسب امكانياتي؟ اذا هل يجب علي شراء سيارة قديمة؟ ان اردت حقا شراء السيارة الان وأريد مختلف الأنواع وتنوع في الأسعار فاين يجب ان اذهب هل هناك مدينة ستقدم لي فرصة افضل عن غيرها؟  الصنع فلا اريد التورط بسيارة قديمة.


بعد رؤية اين يتمركز سوق السيارات المستعملة في المملكة العربية السعودية وجدت ان العاصمة الرياض اكلت الحصه الأكبر من هذا السوق فالان يجب علي الذهاب للعاصمة فقد اجد فرصة تناسب متطلباتي وامكانياتي.
</div>
'''

st.html(fifth)

